
const mapping = {
    "木火": "大吉",
    "火土": "大吉",
    "土金": "大吉",
    "金水": "大吉",
    "水木": "大吉",
    "火木": "半吉",
    "土火": "半吉",
    "金土": "半吉",
    "水金": "半吉",
    "木水": "半吉",
    "土木": "半凶",
    "金火": "半凶",
    "水土": "半凶",
    "木金": "半凶",
    "火水": "半凶",
    "木土": "大凶",
    "火金": "大凶",
    "土水": "大凶",
    "金木": "大凶",
    "水火": "大凶",
    "木木": "大吉",
    "火火": "半吉",
    "土土": "半吉",
    "金金": "半凶",
    "水水": "大凶",
};
const result = {
  calc: (left, right) => {
    return mapping[left + right];
  }
};


module.exports = result;
